import React, { useState } from 'react';
import "animate.css/animate.min.css";
import {AnimationOnScroll} from "react-animation-on-scroll";


const History = () => {
    const [more, setMore] = useState(false);
    const seeFullText = () => {
        setMore(!more);
    }
    const fullText = `পরাধীনতার নাগপাশে আবদ্ধ জাতির পুনর্জাগরণের এর গুরুত্বপূর্ণ সময়ে নারায়নগঞ্জের আড়াইহাজার উপজেলার দুপ্তারা গ্রামে প্রতিষ্ঠিত হয় দুপ্তারা সেন্ট্রাল করোনেশন উচ্চ বিদ্যালয়। এ বিদ্যালয় দুপ্তারা, কালিবাড়ি, গিরদা, বাজবী, সত্যভান্দি, বান্টিসহ আশপাশের এক বিস্তীর্ণ জনপদে ছড়িয়ে আসছে শিক্ষার আলো।

    ইতিহাস পর্যালোচনা করলে দেখা যায়, সেই বিংশ শতাব্দীর দ্বিতীয় দশকে দুপ্তারা ছিল প্রভাবশালী দোর্দন্ড প্রতাপ জমিদারদের পীঠস্থান। ওই সময় এখানে বসবাসকারী লোকজন আর্থিকভাবে অসচ্ছল এবং শিক্ষা দীক্ষায় পশ্চাদপদ। উচ্চ বিদ্যালয়ের অভাব, আর্থিক দৈন্য ও দুর্গম পথঘাট প্রভৃতি কারণে তাদের উচ্চ শিক্ষার আশা যেন সেখানেই শেষ হয়ে যেত। ঠিক এমনি অবস্থায় এলাকার শিক্ষানুরাগী জমিদার শ্রী রাজেন্দ্র চন্দ্র সেন রায়, শ্রী যতীন্দ্র চন্দ্র সেন রায় এবং একমাত্র মুসলিম শিক্ষানুরাগী মাওলানা মফিজউদ্দিন আহম্মেদ এলাকার ছেলে মেয়েদের শিক্ষা গ্রহণের সুবিধার্থে ১৯১২ সালের ১১ জানুয়ারী এ বিদ্যালয় প্রতিষ্ঠা করেন। তৎকালীন ভারত সম্রাজ্যের অধিশ্বরী ব্রিটিশরাজ্য পঞ্চম জর্জের ভারত আগমনে(ডিসেম্বর /১৯১১-জানুয়ারী /১৯১২) ও তার রাজ্যাভিষেক(Coronation) উপক্ষে এ বিদ্যালয়ের নাম ‘Central Coronation High School’ রাখা হয়েছিল। ধারনা করা হয়ে থাকে ব্রিটিশ রাজাকে সম্মানিত ও সন্তুষ্ট করে বিদ্যালয়ের স্বীকৃতি আদায়ের লক্ষ্যে বিদ্যালয়ের নামকরণের ক্ষেত্রে এ কৌশল নেয়া হয়েছিল। ১৯১৬ সালে স্কুলের নামে রেজিষ্ট্রি দলিলের মাধ্যমে জমি সম্প্রদানের পর কলকাতা বিশ্ববিদ্যালয় সিনেট হাউস স্মারক নং - S / R - 17 তারিখ: ৩১-১২-১৯১৯ খ্রিষ্টাব্দে বিদ্যালয়টি প্রথম ও স্থায়ী স্বীকৃতি লাভ করে। এরপর থেকে এ শিক্ষা প্রতিষ্ঠান দীর্ঘ পথ পরিক্রমায় আজও অমলিন গৌরবে গৌরবান্বিত। এর ধারাবাহিকতায় আজও শিক্ষার দ্যুতি ছড়িয়ে চলেছে শতবর্ষী এ বিদ্যালয়। 

    শান্ত পরিবেশ, বিশাল মাঠ আর সুবিশাল দিঘী পরিবেষ্টিত এ বিদ্যালয়। দিঘীতে শানবাঁধানো ঘাট। প্রতিষ্ঠালগ্নের অপূর্ব নির্মাণশৈলীর পূর্বমুখী বিদ্যালয় ভবনটি আজও দাড়িঁয়ে আছে। বিদ্যালয়ের প্রবেশের বাম পাশে দানকৃত জায়গায় খেলাধুলার জন্য রয়েছে বিশাল মাঠ। 

    প্রায় দেড় একর আবাদী জমির মাঝখানে পুকুর খনন ও উহার চারদিকে মাটি ভরাট করে সেখানে নির্মাণ করা হয় এক বিশাল হল রুমসহ দশ কক্ষ বিশিষ্ট প্রাসাদোপম সুদৃশ্য বিদ্যালয় ভবন। ১৯৯২ সালে বিদ্যালয়টি সরকারি উন্নয়ন পরিকল্পনার অন্তর্ভূক্ত করা হয়। পরিকল্পনা অনুসারে ঝুঁকিপূর্ণ পুরাতন ভবন ভেঙ্গে সেখানে একের পর এক নতুন ভবন নির্মিত হয়। বিদ্যালয়ের নিজস্ব অর্থায়নে ছয় কক্ষের দ্বিতল ভবনসহ পর্যায়ক্রমে দুইটি বিশাল একাডেমিক ভবন ও একটি সুদৃশ্য প্রশাসনিক ভবন নির্মিত হয়। বিদ্যালয়ের ক্যাম্পাসে রয়েছে দৃষ্টিনন্দন একটি মসজিদ। ১৯৩০ খৃষ্টাব্দে বিদ্যালয়ের প্রথম প্রধান শিক্ষক ছিলেন বাবু কুমুদ বন্ধু দাস, পর্যায়ক্রমে বাবু বরদাকান্ত সেন, বাবু পরেশ চন্দ্র সেন, মৌলভী আবুল ফয়েজ, মিজানুর রহমান প্রধান শিক্ষক হিসেবে দায়িত্ব পালন করে গেছেন। বিদ্যালয় পরিচালনা কমিটির সভাপতি ডা.সায়মা আফরোজ ইভার তত্ত্বাবধানে মোঃ গিয়াস উদ্দিন সরকার বর্তমানে বিদ্যালয়ের প্রধান শিক্ষক হিসেবে দক্ষতার সহিত দায়িত্ব পালন করছেন। 

    ২০০৯ থেকে বর্তমান সময় পর্যন্ত মাননীয় সংসদ সদস্য আলহাজ নজরুল ইসলাম বাবু’র আমলে বিদ্যালয়ের সীমানা প্রাচীর, চারতলা ভিত বিশিষ্ট তিনতলা প্রশাসনিক একাডেমিক ভবন, তিনতলা ভিত বিশিষ্ট এক তলা একাডেমিক ভবন, উর্ধ্বমূখী সম্প্রসারণ, আলহাজ নজরুল ইসলাম বাবু অডিটরিয়াম নির্মাণসহ ১৭টি ল্যাপটপ সম্বলিত শেখ রাসেল ডিজিটাল ল্যাব প্রতিষ্ঠা করা হয়েছে। 

    শর্তবর্ষে সমৃদ্ধ ঐত্যিবাহী এই বিদ্যালয়টি শিক্ষিত জনগোষ্ঠী তৈরিতে অনন্য ভূমিকা রেখেছে। বাংলাদেশের অনেক প্রথিতযশা গুণী ব্যক্তিত্ব এই স্কুল থেকে শিক্ষাজীবন শুরু করেন। এ বিদ্যালয়ের শিক্ষার্থীরা প্রাদেশিক পরিষদ ও জাতীয় সংসদে একাধিকবার অত্র এলাকার প্রধিনিধিত্বসহ অসংখ্য শিক্ষার্থী সরকারের বিভিন্ন গুরুত্বপূর্ণ পদ অলংকৃত করেছেন। এদের মধ্যে কেন্দ্রীয় ছাত্রলীগের সাবেক সাধারণ সম্পাদক(২০০২-২০০৬) ও সংসদ সদস্য আলহাজ নজরুল ইসলাম বাবু, স্থানীয় ও রাজস্ব অডিটের মহাপরিচালক মুক্তিযোদ্ধা আব্দুল বাছেত খান, ঢাকা বিশ্ববিদ্যালয়ের সাবেক রেজিস্টার ও প্লানিং কমিশনের সদস্য সামসুল হক খান, সাবেক এমএলএ ও প্রেসিডেন্ট তোফাজ্জ্বল হোসেন আমান, সাবেক ইউপি চেয়ারম্যান ডা.রেজাউর রহমান, বিশিষ্ট চিকিৎসক ডা.মিজানুর রহমান, ডাকসুর সাবেক এজিএস মঞ্জরুল ইসলাম মঞ্জ, এডভোকেট নজরুল ইসলাম, প্রাথমিক শিক্ষা অধিদপ্তরের সাবেক মহাপরিচালক জহিরুল ইসলাম, মুক্তিযোদ্ধা এস এম মাজহারুল হক, রাষ্ট্রপতি পুরুষ্কারপ্রাপ্ত জাতীয় ফুটবল খেলোয়ার ফজলুর রহমান আরজু, ইসলামী ব্যাংকের সাবেক ব্যবস্থাপনা পরিচালক মোহাম্মদ আব্দুল মান্নানসহ আরও অনেকে অত্র বিদ্যালয়ের ছাত্র ছিলেন। ছাত্র / ছাত্রী একহাজার ৮শ’ জন।

    বিদ্যালয়ের বিজ্ঞান, মানবিক, ব্যবসায় শাখা শিক্ষার্থী লেখাপড়া করছে। বর্তমানে(২০১৯ সালে) বৃত্তি প্রাপ্ত শিক্ষার্থীর সংখ্যা ছিল ৯০ জন।`

    return (
        <div className=" bg-base-200 ">

            <AnimationOnScroll animateIn="animate__bounceIn" animateOut='animate__bounceIn'>
            <h1 className="text-5xl text-center py-6 font-bold text-accent">History </h1>
            </AnimationOnScroll>
            <div className="hero ">
                <div className="hero-content flex-col lg:flex-row-reverse">
                    <AnimationOnScroll animateIn="animate__fadeInRight" animateOut='animate__fadeOutRight' className="text-center lg:text-left">
                    
                        <img src="https://i.ibb.co/xhjjxbc/05.png" alt="img" />
                    
                    </AnimationOnScroll>
                    <AnimationOnScroll animateIn=" animate__fadeInLeft" animateOut='animate__fadeOutLeft' className="card flex-shrink-0 w-full lg:w-1/2">
                        <div className="card-body lg:hidden">
                            {
                                more === false ? fullText.slice(0, 1000) : fullText
                            }
                            <button onClick={seeFullText} className="btn btn-secondary max-w-fit mx-auto">{more === false ? "Read More" : "Real Less"}</button>

                        </div>
                        <div className="card-body hidden lg:flex">
                            {
                                fullText.slice(0, 1000)
                            }
                            <label htmlFor="my-modal-4" className="btn btn-secondary max-w-fit mx-auto">Read More</label>
                            
                        </div>

                    </AnimationOnScroll>
                </div>
            </div>
            <input type="checkbox" id="my-modal-4" className="modal-toggle" />
            <label htmlFor="my-modal-4" className="modal cursor-pointer">
                <label className="modal-box absolute w-11/12 max-w-5xl" htmlFor="">
                    <h3 className="text-lg font-bold">History of Central Coronation High School</h3>
                    <p className="py-4">{fullText}</p>
                </label>
            </label>
        </div>
    );
};

export default History;